Revit 2026 API

# ElementGetEntity Method

---

Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Entity GetEntity(
	Schema schema
)
```
```vb
Public Function GetEntity (
	schema As Schema
) As Entity
```
```cpp
public:
Entity^ GetEntity(
	Schema^ schema
)
```
```fsharp
member GetEntity :
        schema : Schema -> Entity
```

#### Parameters

schema Schema
     The Schema describing the Entity.

#### Return Value

Entity The returned Entity.

| Exception | Condition |
| --- | --- |
| ArgumentException | Reading of Entities of this Schema is not allowed to the current add-in. |
| ArgumentNullException | A non-optional argument was null |

The Entity that is returned is a copy of the stored data (with copy-on-write optimization). Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.

#### Reference

Element Class

Autodesk.Revit.DB Namespace